# -*- coding:utf-8 -*-
try:
    from load_icd_v3 import load_icd_code
    from rule_match import match_yun
    from reject_level import reject_level
    from reject_mods import reject_mods
except BaseException:
    from rule_base.load_icd_v3 import load_icd_code
    from rule_base.rule_match import match_yun
    from rule_base.reject_level import reject_level
    from rule_base.reject_mods import reject_mods


def reject_pattern(x, y, pattern_list):
    p_x = []
    p_y = []
    p_xy = []
    for pattern in pattern_list:
        if x.find(pattern) >= 0:
            p_x += [1]
        else:
            p_x += [0]
        if y.find(pattern) >= 0:
            p_y += [1]
        else:
            p_y += [0]
        p_xy += [p_x[-1] * p_y[-1]]
    if sum(p_x) > 0 and sum(p_y) > 0 and sum(p_xy) == 0:
        return True
    return False

"""
body_dict = ["脑", "肺", "腹", "胃", "肠", "肝", "肾", "颈", "胸", "背", "脊",
             "臂", "腿", "臀", "足", "肩", "肋", "椎",
             "锁骨", "尺骨", "踝骨", "肱骨"]
"""
body_dict = ["脑", "肺", "腹", "胃", "肠", "肝", "肾", "颈", "胸", "背", "脊",
             "臂", "腿", "臀", "足", "肩", "肋", "椎", "颅", "颧", "颌",
             "锁骨", "尺骨",  "手掌", "脱", "易激", "消化道"] + ['胃', '烫', '水烫', '烫伤', '水烫伤', '滑膜', '膜炎', '膝', '皱', '膜皱', '滑膜皱', '梗', '底节', '基底节', '隙', '腔隙', '陈', '旧', '陈旧', '擦', '右', '肺', '瘤', '癌', '骨', '血小', '小板', '血小板', '肾', '输', '尿', '石', '输尿', '尿管', '输尿管', '肱', '肱骨', '神', '经', '神经', '浆', '汗', '角', '高', '压', '高血', '血压', '发性高', '高血压', '原发性高', '3', '眠', '失眠', '曲', '张', '曲张', '鼻', '鼻腔', '甲', '状腺', '术', '乳', '头状', '乳头状', '复', '复发', '5', '剖', '宫', '胎', '截', '膜外', '黑', '肝', '溃', '疡', '溃疡', '转', '转移', '列', '前列', '列腺', '前列腺', '糖', '糖尿', '尿病', '糖尿病', '支', '架', '支架', '急', '抬', '心', '急性', '段抬', '抬高', '高型', '段抬高', '抬高型', '段抬高型', '卵', '圆', '孔', '卵圆', '圆孔', '孔未', '卵圆孔', '孔未闭', '横', '肠', '横结', '结肠', '横结肠', '铁', '胸', '疹', '痛', '带状', '狭', '窄', '狭窄', '主动', '主动脉', '鞘', '经鞘', '鞘瘤', '神经鞘', '经鞘瘤', '神经鞘瘤', '频', '腹', '盘', '半', '月', '盘状', '状半', '半月', '月板', '盘状半', '状半月', '半月板', '盘状半月', '状半月板', '副', '听', '蛋', '白', '蛋白', '枪', '管状', '腺瘤', '管状腺', '状腺瘤', '管状腺瘤', '降', '降结', '降结肠', '鳞', '疗', '中医', '医治', '中医治', '医治疗', '中医治疗', '胰', '缩', '物神', '植物神', '物神经', '植物神经', '躯体', '裂', '引流', '囊', '芽', '异物', '肉芽', '狼', '疮', '狼疮', '钙', '胸膜', '钙化', '厚', '阴道', '外阴', '缔', '缔组', '缔组织', '间', '间质', '颈', '宫颈', '髓', '骨髓', '言', '语言', '发育', '破坏', '胫', '纤', '维', '纤维', '颤', '2型', '型糖', '型糖尿', '型糖尿病', '绝经', '股', '趾', '抗', '宿', '性移', '移植', '物抗', '抗宿', '宿主', '性移植', '植物抗', '物抗宿', '抗宿主', '移植物抗', '植物抗宿', '物抗宿主', '会', '壁', '道前', '后壁', '阴道前', '松', '导管', '内乳', '导管内', '管内乳', '内乳头', '导管内乳', '管内乳头', '内乳头状', '踝', '内膜', '慢', '慢性', '慢性支', '气管炎', '慢性支气', '支气管炎', '学', '化学', '学治', '化学治', '学治疗', '化学治疗', '桥', '肌桥', '脂', '巢', '卵巢', '疣', '霍', '奇', '金', '非霍', '霍奇', '奇金', '非霍奇', '霍奇金', '非霍奇金', '白细', '白细胞', '栓', '血栓', '咳', '嗽', '咳嗽', '夹层', '哮', '喘', '哮喘', '滤', '泡', '滤泡', '胆', '扩', '盆腔', '玻', '阑', '尾', '阑尾', '鼻炎', '敏性鼻', '性鼻炎', '过敏性鼻', '敏性鼻炎', '硬膜', '硬膜下', '截肢', '食', '锌', '膜瘤', '脑膜瘤', '舌', '直', '直肠', '膀', '胱', '膀胱', '精', '衰', '静脉畸', '静脉畸形', '隐', '肪', '脂肪', '尖瓣', '二尖瓣', '三尖瓣', '低', '血糖', '间盘', '挫', '窦', '左', '升结', '升结肠', '腺癌', '表皮', '反流', '骨发', '骨发育', '乙', '乙状', '状结', '乙状结', '状结肠', '乙状结肠', '痕', '小细', '小细胞', '肘', '液性', '全身', '脱髓', '髓鞘', '脱髓鞘', '腹水', '叶状', '印', '戒', '印戒', '戒细', '印戒细', '戒细胞', '印戒细胞', '戒细胞癌', '白血', '白内', '内障', '白内障', '心功', '肉瘤', '儿', '绒', '绒毛', '胆囊', '膜样', '样腺', '内膜样', '膜样腺', '样腺癌', '内膜样腺', '膜样腺癌', '浆液', '浆液性', '蜂', '耳', '新', '新生', '生儿', '新生儿', '鼻咽', '室', '铅', '停', '绵', '海绵', '窦炎', '错', '错构', '构瘤', '错构瘤', '尾骨', '射频', '总', '性胆', '后遗', '贲', '贲门', '楔', '肋', '重', '围神经病', '手术后状', '浸', '润', '浸润', '润性', '浸润性', '髋', '便', '秘', '便秘', '塞', '阻塞', '9', '透', '透明', '明细', '透明细', '明细胞', '透明细胞', '钠', '低钠', '钾', '低钾', '氯', '挛', '挛缩', '月经', '腔炎', '盆腔炎', '风', '混', '盂', '肾盂', '沟', '腹股', '股沟', '腹股沟', '髂', '苔', '平苔', '扁平苔', '纵', '腹膜', '膜后', '腹膜后', '虫', '闭塞', '塞性', '慢性移', '慢性移植', '中耳', '结膜', '结膜炎', '萎', '萎缩', '小脑', '微', '颌', '颌骨', '下颌骨', '复期', '疝', '睾', '管下', '食管下', '持', '瘤维', '维持', '持性', '肿瘤维', '瘤维持', '维持性', '持性化', '性化学', '性肿瘤维', '肿瘤维持', '瘤维持性', '维持性化', '持性化学', '性化学治', '囊炎', '性胆囊', '胆囊炎', '性胆囊炎', '焦', '虑', '焦虑', '抑', '郁', '抑郁', '脐', '瘘', '颌下', '强', '链', '髓瘤', '骨髓瘤', '发性骨髓', '性骨髓瘤', '分期', '穿', '性阑', '尾炎', '穿孔', '性阑尾', '阑尾炎', '性阑尾炎', '胸骨', '膜早', '早破', '胎膜早', '膜早破', '胎膜早破', '阴蒂', '晶', '工晶', '晶体', '人工晶', '工晶体', '人工晶体', '胃窦', '结节', '跟', '肛管', '空', '洞', '空洞', '状腺癌', '翻', '外翻', '副舟', '副舟骨', '平足', '胞瘤', '细胞瘤', '憩', '憩室', '燥', '干燥', '胃底', '胃体', '化不', '消化不', '化不良', '消化不良', '维化', '纤维化', '愈', '慢性乙', '向', '跖', '跖骨', '髓增', '骨髓增', '肝曲', '脾', '胎盘', '佩吉', '吉特', '佩吉特', '袋', '管状腺癌', '白斑', '糜', '烂', '糜烂', '乏力', '6', '短', '暂', '短暂', '暂性', '短暂性', '靶', '靶向', '向治', '靶向治', '向治疗', '靶向治疗', '管细', '胆管细', '管细胞', '胆管细胞', '肝细', '肝细胞', '拇指', '胸中', '呕', '吐', '呕吐', '肝损', '慢性粒', '阻滞', '痒', '弥', '漫', '弥漫', '骨头', '股骨头', '底静', '胃底静', '底静脉', '胃底静脉', '凝', '凝血', '白质', '病综', '尺', '固', '系膜', '肠系膜', '痛风', '颈内', '腘', '动脉瘤', '亢', '氧', '维腺', '纤维腺', '维腺瘤', '纤维腺瘤', '副乳', '茎', '阴茎', '阴囊', '脑室', '律', '冠心', '心病', '病心', '心律', '冠心病', '心病心', '冠心病心', '绞', '心绞', '绞痛', '心绞痛', '鼻骨', '马', '类风', '类风湿', '前壁', '正中', '中神', '正中神', '中神经', '正中神经', '内翻', '黄', '疸', '性黄', '黄疸', '进食', '认', '认知', '小动脉', '大便', '腭', '腺样', '疖', '疖肿', '距', '阻塞性', '塞性肺', '阻塞性肺', '裂瘘', '回', '乳素', '腓', '未分', '未分化', '矿', '矿物', '物质', '矿物质', '维生', '生素', '维生素', '近', '脑干', '牙龈', '酒', '黄斑', '疏', '质疏', '疏松', '骨质疏', '质疏松', '骨质疏松', '锁', '锁骨', '骨上', '锁骨上', '络', '脉络', '络膜', '脉络膜', '多囊', '恶心', '稳', '不稳', '龋', '惊', '母细胞瘤', '旁', '状旁', '旁腺', '甲状旁', '状旁腺', '甲状旁腺', '缺氧', '尿毒', '尿毒症', '腱鞘', '窝', '痔', '腮', '腮腺', '脑缺', '暂性脑', '性脑缺', '脑缺血', '短暂性脑', '暂性脑缺', '性脑缺血', '酮', '术前', '不连', '刀', '纤维囊', '胶', '胶质', '结核', '路', '腋', '恩', '上颌骨', '肩胛骨', '肺静', '脉异', '肺静脉', '静脉异', '脉异位', '异位引', '位引流', '肺静脉异', '静脉异位', '脉异位引', '异位引流', '内分', '盲肠', '动态', '态未', '动态未', '郁症', '抑郁症', '粘连', '嘴', '鹰嘴', '桡', '融合', '壶', '壶腹', '骰骨', '路上', '皮癌', '尿路上', '路上皮', '上皮癌', '尿路上皮', '路上皮癌', '腓骨', '臀', '臀部', '固定', '兆', '先兆', '类癌', '荨', '荨麻', '麻疹', '荨麻疹', '瘤栓', '廓', '耳廓', '混合', '肾性', '肾性贫', '肾性贫血', '臂', '前臂', '素血', '素血症', '游', '游离', '骨瘤', '畸胎', '胎瘤', '畸胎瘤', '室间隔', '髂骨', '豆骨', '颈总动脉', '毛细', '额骨', '坐骨', '性中', '乳突', '掌骨', '枕骨', '动脉血', '动脉血栓', '联', '剑突', '眉', '输精管', '桡骨头', '熟', '成熟', '罗', '克罗', '罗恩', '克罗恩', '额窦', '胸腺', '骨膜', '深', '嗜酸', '空肠', '钩骨', '上臂', '颧', '颧骨']
body_dict += ["踝骨", "肱骨", "眉", "鼻", "腮", "脱发", "白发", "拇", "双胎", "3胎", "4胎", "5胎", "6胎", "多胎"]
body_dict = set(body_dict)
#['胃', '烫', '水烫', '烫伤', '水烫伤', '滑膜', '膜炎', '膝', '皱', '膜皱', '滑膜皱', '梗', '底节', '基底节', '隙', '腔隙', '陈', '旧', '陈旧', '擦', '右', '肺', '瘤', '癌', '骨', '血小', '小板', '血小板', '肾', '输', '尿', '石', '输尿', '尿管', '输尿管', '肱', '肱骨', '神', '经', '神经', '浆', '汗', '角', '高', '压', '高血', '血压', '发性高', '高血压', '3', '眠', '失眠', '曲', '张', '曲张', '鼻', '鼻腔', '甲', '状腺', '术', '乳', '头状', '乳头状', '复', '复发', '5', '剖', '宫', '胎', '截', '膜外', '黑', '肝', '溃', '疡', '溃疡', '转', '转移', '列', '前列', '列腺', '前列腺', '糖', '糖尿', '尿病', '糖尿病', '支', '架', '支架', '急', '抬', '心', '急性', '段抬', '抬高', '高型', '段抬高', '抬高型', '卵', '圆', '孔', '卵圆', '圆孔', '孔未', '卵圆孔', '孔未闭', '横', '肠', '横结', '结肠', '横结肠', '铁', '胸', '疹', '痛', '带状', '狭', '窄', '狭窄', '主动', '主动脉', '鞘', '经鞘', '鞘瘤', '神经鞘', '经鞘瘤', '频', '腹', '盘', '半', '月', '盘状', '状半', '半月', '月板', '盘状半', '状半月', '半月板', '副', '听', '蛋', '白', '蛋白', '枪', '管状', '腺瘤', '管状腺', '状腺瘤', '降', '降结', '降结肠', '鳞', '疗', '中医', '医治', '中医治', '医治疗', '胰', '缩', '物神', '植物神', '物神经', '躯体', '裂', '引流', '囊', '芽', '异物', '肉芽', '狼', '疮', '狼疮', '钙', '胸膜', '钙化', '厚', '阴道', '外阴', '缔', '缔组', '缔组织', '间', '间质', '颈', '宫颈', '髓', '骨髓', '言', '语言', '发育', '破坏', '胫', '纤', '维', '纤维', '颤', '2型', '型糖', '型糖尿', '绝经', '股', '趾', '抗', '宿', '性移', '移植', '物抗', '抗宿', '宿主', '性移植', '植物抗', '物抗宿', '抗宿主', '会', '壁', '道前', '后壁', '阴道前', '松', '导管', '内乳', '导管内', '管内乳', '内乳头', '踝', '内膜', '慢', '慢性', '慢性支', '气管炎', '学', '化学', '学治', '化学治', '学治疗', '桥', '肌桥', '脂', '巢', '卵巢', '疣', '霍', '奇', '金', '非霍', '霍奇', '奇金', '非霍奇', '霍奇金', '白细', '白细胞', '栓', '血栓', '咳', '嗽', '咳嗽', '夹层', '哮', '喘', '哮喘', '滤', '泡', '滤泡', '胆', '扩', '盆腔', '玻', '阑', '尾', '阑尾', '鼻炎', '敏性鼻', '性鼻炎', '硬膜', '硬膜下', '截肢', '食', '锌', '膜瘤', '脑膜瘤', '舌', '直', '直肠', '膀', '胱', '膀胱', '精', '衰', '静脉畸', '隐', '肪', '脂肪', '尖瓣', '低', '血糖', '间盘', '挫', '窦', '左', '升结', '升结肠', '腺癌', '表皮', '反流', '骨发', '骨发育', '乙', '乙状', '状结', '乙状结', '状结肠', '痕', '小细', '小细胞', '肘', '液性', '全身', '脱髓', '髓鞘', '脱髓鞘', '腹水', '叶状', '印', '戒', '印戒', '戒细', '印戒细', '戒细胞', '白血', '白内', '内障', '白内障', '心功', '肉瘤', '儿', '绒', '绒毛', '胆囊', '膜样', '样腺', '内膜样', '膜样腺', '样腺癌', '浆液', '浆液性', '蜂', '耳', '新', '新生', '生儿', '新生儿', '鼻咽', '室', '铅', '停', '绵', '海绵', '窦炎', '错', '错构', '构瘤', '错构瘤', '射频', '总', '性胆', '后遗', '贲', '贲门', '楔', '肋', '重', '浸', '润', '浸润', '润性', '浸润性', '髋', '便', '秘', '便秘', '塞', '阻塞', '9', '透', '透明', '明细', '透明细', '明细胞', '钠', '低钠', '钾', '低钾', '氯', '挛', '挛缩', '月经', '腔炎', '盆腔炎', '风', '混', '盂', '肾盂', '沟', '腹股', '股沟', '腹股沟', '髂', '苔', '平苔', '扁平苔', '纵', '腹膜', '膜后', '腹膜后', '虫', '闭塞', '塞性', '慢性移', '中耳', '结膜', '结膜炎', '萎', '萎缩', '小脑', '微', '颌', '颌骨', '复期', '疝', '睾', '管下', '食管下', '持', '瘤维', '维持', '持性', '肿瘤维', '瘤维持', '维持性', '持性化', '性化学', '囊炎', '性胆囊', '胆囊炎', '焦', '虑', '焦虑', '抑', '郁', '抑郁', '脐', '瘘', '颌下', '强', '链', '髓瘤', '骨髓瘤', '分期', '穿', '性阑', '尾炎', '穿孔', '性阑尾', '阑尾炎', '膜早', '早破', '胎膜早', '膜早破', '晶', '工晶', '晶体', '人工晶', '工晶体', '胃窦', '结节', '跟', '空', '洞', '空洞', '状腺癌', '翻', '外翻', '副舟', '副舟骨', '平足', '胞瘤', '细胞瘤', '憩', '憩室', '燥', '干燥', '胃底', '胃体', '化不', '消化不', '化不良', '维化', '纤维化', '愈', '慢性乙', '向', '跖', '髓增', '骨髓增', '肝曲', '脾', '胎盘', '佩吉', '吉特', '佩吉特', '袋', '白斑', '糜', '烂', '糜烂', '乏力', '6', '短', '暂', '短暂', '暂性', '短暂性', '靶', '靶向', '向治', '靶向治', '向治疗', '管细', '胆管细', '管细胞', '肝细', '肝细胞', '拇指', '胸中', '呕', '吐', '呕吐', '肝损', '慢性粒', '阻滞', '痒', '弥', '漫', '弥漫', '骨头', '股骨头', '底静', '胃底静', '底静脉', '凝', '凝血', '白质', '病综', '尺', '固', '系膜', '痛风', '颈内', '腘', '动脉瘤', '亢', '氧', '维腺', '纤维腺', '维腺瘤', '副乳', '茎', '阴茎', '阴囊', '脑室', '律', '冠心', '心病', '病心', '心律', '冠心病', '心病心', '绞', '心绞', '绞痛', '心绞痛', '马', '类风', '类风湿', '前壁', '正中', '中神', '正中神', '中神经', '内翻', '黄', '疸', '性黄', '黄疸', '进食', '认', '认知', '大便', '腭', '腺样', '疖', '疖肿', '距', '阻塞性', '塞性肺', '裂瘘', '回', '乳素', '腓', '未分', '未分化', '矿', '矿物', '物质', '矿物质', '维生', '生素', '维生素', '近', '脑干', '酒', '黄斑', '疏', '质疏', '疏松', '骨质疏', '质疏松', '锁', '锁骨', '骨上', '锁骨上', '络', '脉络', '络膜', '脉络膜', '多囊', '恶心', '稳', '不稳', '龋', '惊', '旁', '状旁', '旁腺', '甲状旁', '状旁腺', '缺氧', '尿毒', '尿毒症', '腱鞘', '窝', '痔', '脑缺', '暂性脑', '性脑缺', '脑缺血', '酮', '术前', '不连', '刀', '胶', '胶质', '结核', '路', '腋', '恩', '肺静', '脉异', '肺静脉', '静脉异', '脉异位', '异位引', '位引流', '内分', '盲肠', '动态', '态未', '动态未', '郁症', '抑郁症', '粘连', '桡', '融合', '壶', '壶腹', '路上', '皮癌', '尿路上', '路上皮', '上皮癌', '腓骨', '臀', '臀部', '固定', '兆', '先兆', '类癌', '荨', '荨麻', '麻疹', '荨麻疹', '瘤栓', '廓', '耳廓', '混合', '肾性', '肾性贫', '臂', '前臂', '素血', '素血症', '游', '游离', '骨瘤', '畸胎', '胎瘤', '畸胎瘤', '毛细', '性中', '动脉血', '联', '熟', '成熟', '罗', '克罗', '罗恩', '克罗恩', '嗜酸']
#"""

reject_icd_dict = ["?动脉粥样硬化", "脱发", "白发"]


def extract_body(x):
    body_list = []
    for i in range(len(x)):
        if x[i] in body_dict:
            body_list.append(x[i])
        if i + 1 < len(x):
            if x[i:i+2] in body_dict:
                body_list.append(x[i:i+2])
        if i + 2 < len(x):
            if x[i:i+3] in body_dict:
                body_list.append(x[i:i+3])
    return body_list


contain_map = {"内脏": "肝"}


def contain(x, y):
    if x == y:
        return True
    if x in contain_map and y in contain_map[x]:
        return True
    return False


def reject_body(x, y):
    x_body = extract_body(x)
    y_body = extract_body(y)

    # if y_body > x_body, reject
    if not y_body:
        return False
    else:
        for y in y_body:
            tmp = False
            for x in x_body:
                if contain(x, y):
                    tmp = True
            if not tmp:
                return True
    return False


def reject_yun(x, y):
    y_yun = match_yun(x)
    return not y in y_yun

def reject_neg(x, y):
    x_neg = x.find('非')
    if x_neg == -1:
        x_neg = x.find('不')
    y_neg = y.find('非')
    if y_neg == -1:
        y_neg = y.find('不')

    if x_neg < 0 and y_neg < 0:
        return False
    if x_neg >= 0 and y_neg >= 0:
        return False
    if x_neg >= 0 and y_neg < 0:
        key = x[x_neg + 1:min(x_neg + 3, len(x))]
        if key and y.find(key) >= 0:
            return True
    if y_neg >= 0 and x_neg < 0:
        key = y[y_neg + 1:min(y_neg + 3, len(y))]
        if key and x.find(key) >= 0:
            return True
    return False


def reject_single_pair(x, y):
    if x.find("双") >= 0:
        return False
    if x.find("左") >= 0 or x.find("右") >= 0:
        if y.find("单") < 0 and y.find("双") >= 0:
            return True
    return False


def reject(x, y):
    x = x.lower()
    y = y.lower()
    if y[0] == "孕" and y[-1] == "周" and reject_yun(x, y):
        return True
    if reject_pattern(x, y, ["高", "低"]):
        return True
    if reject_pattern(x, y, ["1级", "2级", "3级", "4级", "5级"]):
        return True
    if reject_pattern(x, y, ["1型", "2型", "3型", "4型", "5型"]):
        return True
    if reject_pattern(x, y, ["1度", "2度", "3度", "4度", "5度"]):
        return True
    if reject_pattern(x, y, ["g1", "g2", "g3", "g4"]):
        return True
    if reject_pattern(x, y, ["l1", "l2", "l3", "l4", "l5"]):
        return True
    if reject_pattern(x, y, ["良性", "恶性"]):
        return True
    if reject_pattern(x, y, ["卡压", "挤压"]):
        return True
    if reject_pattern(x, y, ["ca125", "ca199"]):
        return True
    if reject_pattern(x, y, ["过熟期", "未成熟期"]):
        return True
    if reject_pattern(x, y, ["擦伤", "冻伤", "烧伤", "腐蚀伤", "割伤", "扭伤"]):
        return True
    if reject_pattern(x, y, ["先天", "后天"]):
        return True
    if reject_pattern(x, y, ["左", "右"]):
        return True
    if reject_pattern(x, y, ["上", "下"]):
        return True
    if reject_pattern(x, y, ["前", "后"]):
        return True
    if reject_pattern(x, y, ["内", "外"]):
        return True
    if reject_pattern(x, y, ["远", "近"]):
        return True  
    if reject_pattern(x, y, ["深", "浅"]):
        return True
    if reject_pattern(x, y, ["软", "硬"]):
        return True
    if reject_pattern(x, y, ["开放", "闭合"]):
        return True
    if reject_pattern(x, y, ["完全", "部分"]):
        return True
    if reject_pattern(x, y, ["男", "女"]):
        return True
    if reject_single_pair(x, y):
        return True
    if reject_neg(x, y):
        return True
    if x.find("鳞") == -1 and y.find("鳞") >= 0:
        return True
    if y in reject_icd_dict:
        return True
    if reject_body(x, y):
        return True
    if reject_level(x, y):
        return True
    return False


def reject_icd(y_pred, standard2clean, clean2code):
    y_new_pred = []
    for y in y_pred:
        tmp_remove = []
        for y_i in y:
            for y_j in y:
                if y_j != "癌" and y_i != y_j:
                    #if clean2code[standard2clean[y_i]].startswith(clean2code[standard2clean[y_j]]):
                    #    tmp_remove.append(y_j)
                    #elif (set(standard2clean[y_i]).issuperset(set(standard2clean[y_j])) or set(y_i).issuperset(set(y_j))) and not clean2code[standard2clean[y_j]].startswith(clean2code[standard2clean[y_i]]):
                    #    tmp_remove.append(y_j)
                    if clean2code[y_i].startswith(clean2code[y_j]):
                        tmp_remove.append(y_j)
                    elif (set(y_i).issuperset(set(y_j)) or set(y_i).issuperset(set(y_j))) and not clean2code[y_j].startswith(clean2code[y_i]):
                        tmp_remove.append(y_j)
        tmp_append = [y_i for y_i in y if not y_i in tmp_remove]
        if not tmp_append and y:
            max_l = max([len(y_i) for y_i in y])
            for y_i in y:
                if len(y_i) == max_l:
                    tmp_append = [y_i]
        if len(tmp_append) > 1:
            new_tmp_append = []
            for tmp in tmp_append:
                if tmp.find("的其他") < 0 or tmp.find("他处的"):
                    new_tmp_append.append(tmp)
        else:
            new_tmp_append = tmp_append
        y_new_pred.append(new_tmp_append)
    return y_new_pred

def clean_for_reject_only(y):
    return y.replace("不除外", "")

def reject_y_inside(x, y_list):
    return reject_mods(x, y_list)

def reject_pred(x_list, y_pred, icd_reject=False, standard2clean=None, clean2code=None):
    x_list = [clean_for_reject_only(x) for x in x_list]
    y_pred = [[clean_for_reject_only(yy) for yy in y] for y in y_pred]
    original_count = sum([len(y) for y in y_pred])
    y_new_pred = [list(set([y for y in y_pred[idx] if not reject(
        x, y)])) for idx, x in enumerate(x_list)]
    if icd_reject:
        y_new_pred = reject_icd(y_new_pred, standard2clean, clean2code)
    y_new_pred = [reject_y_inside(x_list[idx], y_new_pred[idx]) for idx in range(len(x_list))]
    new_count = sum([len(y) for y in y_new_pred])
    print(f"Original count: {original_count}")
    print(f"New count: {new_count}")
    print(f"Reject count: {original_count - new_count}")
    return y_new_pred



if __name__ == "__main__":
    #clean2standard, origin_y, standard2clean, cleaned_y, clean2code = load_icd_code()
    """
    #import ipdb
    #ipdb.set_trace()
    print(reject_pred(['i级宫颈上皮内肿瘤[宫颈上皮内瘤变]'],
                [['子宫颈上皮内瘤变III级[CINIII级]', '上皮瘤']],
                icd_reject=True, standard2clean=standard2clean, clean2code=clean2code))
    """
    #import ipdb; ipdb.set_trace()
    assert reject_neg("极高危非梗阻型肥厚性心脏病", "梗阻性肥厚型心肌病")
    assert reject("左上肢拇指皮肤缺失软组织缺失","下肢皮肤缺损")
    #import ipdb; ipdb.set_trace()
    print(reject_pred(["右上臂开放伤伴皮肤撕脱"], ["上肢开放性损伤##上臂开放性损伤##下肢开放性损伤##下肢撕脱伤##腕部开放性损伤".split("##")], False,
                      None, None))